## Plan Result (nonprod_general - TerraformPlanApply)




<pre><code>Plan: 1 to add, 15 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_postgresql_flexible_server.atlassian-nonprod-flex-server-v15[0]
* Update
  * azurerm_application_gateway.ag
  * azurerm_key_vault.atlassian_kv
  * azurerm_postgresql_flexible_server.atlassian-flex-server
  * azurerm_postgresql_flexible_server.atlassian-flex-server-temp[0]
  * azurerm_postgresql_server.atlassian-server[0]
  * module.networking.azurerm_subnet.this[&#34;atlassian-int-nonprod-vnet-atlassian-int-subnet-postgres-flex&#34;]
  * module.vm-bootstrap[&#34;atlassian-nonprod-confluence-02&#34;].azurerm_virtual_machine_extension.dynatrace_oneagent[0]
  * module.vm-bootstrap[&#34;atlassian-nonprod-confluence-04&#34;].azurerm_virtual_machine_extension.dynatrace_oneagent[0]
  * module.vm-bootstrap[&#34;atlassian-nonprod-crowd-01&#34;].azurerm_virtual_machine_extension.dynatrace_oneagent[0]
  * module.vm-bootstrap[&#34;atlassian-nonprod-gluster-01&#34;].azurerm_virtual_machine_extension.dynatrace_oneagent[0]
  * module.vm-bootstrap[&#34;atlassian-nonprod-gluster-02&#34;].azurerm_virtual_machine_extension.dynatrace_oneagent[0]
  * module.vm-bootstrap[&#34;atlassian-nonprod-gluster-03&#34;].azurerm_virtual_machine_extension.dynatrace_oneagent[0]
  * module.vm-bootstrap[&#34;atlassian-nonprod-jira-01&#34;].azurerm_virtual_machine_extension.dynatrace_oneagent[0]
  * module.vm-bootstrap[&#34;atlassian-nonprod-jira-02&#34;].azurerm_virtual_machine_extension.dynatrace_oneagent[0]
  * module.vm-bootstrap[&#34;atlassian-nonprod-jira-03&#34;].azurerm_virtual_machine_extension.dynatrace_oneagent[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # data.azurerm_key_vault_secret.POSTGRES-FLEX-SERVER-PASS will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "POSTGRES-FLEX-SERVER-PASS" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
      + name                    = "nonprod-POSTGRES-FLEX-SERVER-PASS"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.POSTGRES-FLEX-SERVER-USER will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "POSTGRES-FLEX-SERVER-USER" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
      + name                    = "nonprod-POSTGRES-FLEX-SERVER-USER"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.POSTGRES-SINGLE-SERVER-PASS will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "POSTGRES-SINGLE-SERVER-PASS" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
      + name                    = "nonprod-POSTGRES-SINGLE-SERVER-PASS"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.POSTGRES-SINGLE-SERVER-USER will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "POSTGRES-SINGLE-SERVER-USER" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
      + name                    = "nonprod-POSTGRES-SINGLE-SERVER-USER"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.admin_private_key will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "admin_private_key" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
      + name                    = "test-private-key"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.admin_username will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "admin_username" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
      + name                    = "vm-admin-username"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # azurerm_application_gateway.ag will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway"
        name                              = "atlassian-nonprod-app-gateway"
        tags                              = {
            "application"  = "atlassian"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (8 unchanged attributes hidden)

      - probe {
          - id                                        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/probes/appgw-probe-cnf" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-cnf" -> null
          - path                                      = "/confluence" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      - probe {
          - id                                        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/probes/appgw-probe-crd" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-crd" -> null
          - path                                      = "/crowd" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      - probe {
          - id                                        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/probes/appgw-probe-jira" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-jira" -> null
          - path                                      = "/jira/status" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-cnf"
          + path                                      = "/confluence"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-crd"
          + path                                      = "/crowd"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-jira"
          + path                                      = "/jira/status"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }

      - request_routing_rule {
          - http_listener_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/httpListeners/appgw-http-listener" -> null
          - http_listener_name          = "appgw-http-listener" -> null
          - id                          = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/requestRoutingRules/appgw-routing-rule" -> null
          - name                        = "appgw-routing-rule" -> null
          - priority                    = 1 -> null
          - rule_type                   = "PathBasedRouting" -> null
          - url_path_map_id             = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/urlPathMaps/appgw-url-map-path" -> null
          - url_path_map_name           = "appgw-url-map-path" -> null
            # (8 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "appgw-backend-pool-cnf"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "appgw-backend-settings-cnf"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "appgw-http-listener"
          + id                          = (known after apply)
          + name                        = "appgw-routing-rule"
          + priority                    = 1
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "PathBasedRouting"
          + url_path_map_id             = (known after apply)
          + url_path_map_name           = "appgw-url-map-path"
            # (2 unchanged attributes hidden)
        }

        # (18 unchanged blocks hidden)
    }

  # azurerm_key_vault.atlassian_kv will be updated in-place
  ~ resource "azurerm_key_vault" "atlassian_kv" {
      ~ access_policy                   = [
            {
                application_id          = null
                certificate_permissions = []
                key_permissions         = []
                object_id               = "345d18cb-dabd-48f4-80fc-ea735abf14f1"
                secret_permissions      = [
                    "Get",
                    "List",
                    "Set",
                    "Delete",
                    "Purge",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
          + {
              + certificate_permissions = []
              + key_permissions         = []
              + object_id               = "345d18cb-dabd-48f4-80fc-ea735abf14f1"
              + secret_permissions      = [
                  + "Get",
                  + "List",
                  + "Set",
                  + "Delete",
                  + "Purge",
                ]
              + storage_permissions     = []
              + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
                # (1 unchanged attribute hidden)
            },
            {
                application_id          = null
                certificate_permissions = [
                    "Get",
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                    "ManageContacts",
                    "ManageIssuers",
                    "GetIssuers",
                    "ListIssuers",
                    "SetIssuers",
                    "DeleteIssuers",
                ]
                key_permissions         = [
                    "Get",
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                    "GetRotationPolicy",
                    "SetRotationPolicy",
                    "Rotate",
                ]
                object_id               = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
                secret_permissions      = [
                    "Get",
                    "List",
                    "Set",
                    "Delete",
                    "Purge",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
            # (2 unchanged elements hidden)
        ]
        id                              = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
        name                            = "atlasssian-nonprod-kv"
        tags                            = {
            "application"  = "atlassian"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_postgresql_flexible_server.atlassian-flex-server will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server" "atlassian-flex-server" {
      ~ administrator_password            = (sensitive value)
        id                                = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/atlassian-nonprod-flex-server"
        name                              = "atlassian-nonprod-flex-server"
        tags                              = {
            "application"  = "atlassian"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (18 unchanged attributes hidden)

      ~ authentication {
          + tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_postgresql_flexible_server.atlassian-flex-server-temp[0] will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server" "atlassian-flex-server-temp" {
      ~ administrator_password            = (sensitive value)
        id                                = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/atlassian-nonprod-flex-server-temp"
        name                              = "atlassian-nonprod-flex-server-temp"
        tags                              = {
            "application"  = "atlassian"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (21 unchanged attributes hidden)

      ~ authentication {
          + tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_postgresql_flexible_server.atlassian-nonprod-flex-server-v15[0] will be created
  + resource "azurerm_postgresql_flexible_server" "atlassian-nonprod-flex-server-v15" {
      + administrator_login 

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

               = (known after apply)
      + description                 = (known after apply)
      + destinations                = (known after apply)
      + id                          = (known after apply)
      + identity                    = (known after apply)
      + immutable_id                = (known after apply)
      + kind                        = (known after apply)
      + location                    = (known after apply)
      + name                        = "ama-linux-vm-logs"
      + resource_group_name         = "oms-automation"
      + stream_declaration          = (known after apply)
      + tags                        = (known after apply)
    }

  # module.vm-bootstrap["atlassian-nonprod-gluster-03"].data.azurerm_monitor_data_collection_rule.windows_data_collection_rule will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_data_collection_rule" "windows_data_collection_rule" {
      + data_collection_endpoint_id = (known after apply)
      + data_flow                   = (known after apply)
      + data_sources                = (known after apply)
      + description                 = (known after apply)
      + destinations                = (known after apply)
      + id                          = (known after apply)
      + identity                    = (known after apply)
      + immutable_id                = (known after apply)
      + kind                        = (known after apply)
      + location                    = (known after apply)
      + name                        = "ama-windows-vm-logs"
      + resource_group_name         = "oms-automation"
      + stream_declaration          = (known after apply)
      + tags                        = (known after apply)
    }

  # module.vm-bootstrap["atlassian-nonprod-gluster-03"].data.azurerm_resource_group.la_rg will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "la_rg" {
      + id         = (known after apply)
      + location   = (known after apply)
      + managed_by = (known after apply)
      + name       = "oms-automation"
      + tags       = (known after apply)
    }

  # module.vm-bootstrap["atlassian-nonprod-gluster-03"].azurerm_virtual_machine_extension.dynatrace_oneagent[0] will be updated in-place
  ~ resource "azurerm_virtual_machine_extension" "dynatrace_oneagent" {
        id                          = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-nonprod-gluster-03/extensions/Dynatrace"
        name                        = "Dynatrace"
      ~ settings                    = (sensitive value)
        tags                        = {
            "application"  = "atlassian"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (8 unchanged attributes hidden)
    }

  # module.vm-bootstrap["atlassian-nonprod-jira-01"].data.azurerm_key_vault.cnp_vault[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "cnp_vault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = "infra-vault-nonprod"
      + network_acls                    = (known after apply)
      + public_network_access_enabled   = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + resource_group_name             = "cnp-core-infra"
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)
    }

  # module.vm-bootstrap["atlassian-nonprod-jira-01"].data.azurerm_key_vault_secret.token[0] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_key_vault_secret" "token" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "dynatrace-nonprod-token"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # module.vm-bootstrap["atlassian-nonprod-jira-01"].data.azurerm_monitor_data_collection_rule.linux_data_collection_rule will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_data_collection_rule" "linux_data_collection_rule" {
      + data_collection_endpoint_id = (known after apply)
      + data_flow                   = (known after apply)
      + data_sources                = (known after apply)
      + description                 = (known after apply)
      + destinations                = (known after apply)
      + id                          = (known after apply)
      + identity                    = (known after apply)
      + immutable_id                = (known after apply)
      + kind                        = (known after apply)
      + location                    = (known after apply)
      + name                        = "ama-linux-vm-logs"
      + resource_group_name         = "oms-automation"
      + stream_declaration          = (known after apply)
      + tags                        = (known after apply)
    }

  # module.vm-bootstrap["atlassian-nonprod-jira-01"].data.azurerm_monitor_data_collection_rule.windows_data_collection_rule will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_data_collection_rule" "windows_data_collection_rule" {
      + data_collection_endpoint_id = (known after apply)
      + data_flow                   = (known after apply)
      + data_sources                = (known after apply)
      + description                 = (known after apply)
      + destinations                = (known after apply)
      + id                          = (known after apply)
      + identity                    = (known after apply)
      + immutable_id                = (known after apply)
      + kind                        = (known after apply)
      + location                    = (known after apply)
      + name                        = "ama-windows-vm-logs"
      + resource_group_name         = "oms-automation"
      + stream_declaration          = (known after apply)
      + tags                        = (known after apply)
    }

  # module.vm-bootstrap["atlassian-nonprod-jira-01"].data.azurerm_resource_group.la_rg will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "la_rg" {
      + id         = (known after apply)
      + location   = (known after apply)
      + managed_by = (known after apply)
      + name       = "oms-automation"
      + tags       = (known after apply)
    }

  # module.vm-bootstrap["atlassian-nonprod-jira-01"].azurerm_virtual_machine_extension.dynatrace_oneagent[0] will be updated in-place
  ~ resource "azurerm_virtual_machine_extension" "dynatrace_oneagent" {
        id                          = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-nonprod-jira-01/extensions/Dynatrace"
        name                        = "Dynatrace"
      ~ settings                    = (sensitive value)
        tags                        = {
            "application"  = "atlassian"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (8 unchanged attributes hidden)
    }

  # module.vm-bootstrap["atlassian-nonprod-jira-02"].data.azurerm_key_vault.cnp_vault[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "cnp_vault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = "infra-vault-nonprod"
      + network_acls                    = (known after apply)
      + public_network_access_enabled   = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + resource_group_name             = "cnp-core-infra"
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)
    }

  # module.vm-bootstrap["atlassian-nonprod-jira-02"].data.azurerm_key_vault_secret.token[0] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_key_vault_secret" "token" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "dynatrace-nonprod-token"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # module.vm-bootstrap["atlassian-nonprod-jira-02"].data.azurerm_monitor_data_collection_rule.linux_data_collection_rule will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_data_collection_rule" "linux_data_collection_rule" {
      + data_collection_endpoint_id = (known after apply)
      + data_flow                   = (known after apply)
      + data_sources                = (known after apply)
      + description                 = (known after apply)
      + destinations                = (known after apply)
      + id                          = (known after apply)
      + identity                    = (known after apply)
      + immutable_id                = (known after apply)
      + kind                        = (known after apply)
      + location                    = (known after apply)
      + name                        = "ama-linux-vm-logs"
      + resource_group_name         = "oms-automation"
      + stream_declaration          = (known after apply)
      + tags                        = (known after apply)
    }

  # module.vm-bootstrap["atlassian-nonprod-jira-02"].data.azurerm_monitor_data_collection_rule.windows_data_collection_rule will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_data_collection_rule" "windows_data_collection_rule" {
      + data_collection_endpoint_id = (known after apply)
      + data_flow                   = (known after apply)
      + data_sources                = (known after apply)
      + description                 = (known after apply)
      + destinations                = (known after apply)
      + id                          = (known after apply)
      + identity                    = (known after apply)
      + immutable_id                = (known after apply)
      + kind                        = (known after apply)
      + location                    = (known after apply)
      + name                        = "ama-windows-vm-logs"
      + resource_group_name         = "oms-automation"
      + stream_declaration          = (known after apply)
      + tags                        = (known after apply)
    }

  # module.vm-bootstrap["atlassian-nonprod-jira-02"].data.azurerm_resource_group.la_rg will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "la_rg" {
      + id         = (known after apply)
      + location   = (known after apply)
      + managed_by = (known after apply)
      + name       = "oms-automation"
      + tags       = (known after apply)
    }

  # module.vm-bootstrap["atlassian-nonprod-jira-02"].azurerm_virtual_machine_extension.dynatrace_oneagent[0] will be updated in-place
  ~ resource "azurerm_virtual_machine_extension" "dynatrace_oneagent" {
        id                          = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-nonprod-jira-02/extensions/Dynatrace"
        name                        = "Dynatrace"
      ~ settings                    = (sensitive value)
        tags                        = {
            "application"  = "atlassian"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (8 unchanged attributes hidden)
    }

  # module.vm-bootstrap["atlassian-nonprod-jira-03"].data.azurerm_key_vault.cnp_vault[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "cnp_vault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = "infra-vault-nonprod"
      + network_acls                    = (known after apply)
      + public_network_access_enabled   = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + resource_group_name             = "cnp-core-infra"
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)
    }

  # module.vm-bootstrap["atlassian-nonprod-jira-03"].data.azurerm_key_vault_secret.token[0] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_key_vault_secret" "token" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "dynatrace-nonprod-token"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # module.vm-bootstrap["atlassian-nonprod-jira-03"].data.azurerm_monitor_data_collection_rule.linux_data_collection_rule will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_data_collection_rule" "linux_data_collection_rule" {
      + data_collection_endpoint_id = (known after apply)
      + data_flow                   = (known after apply)
      + data_sources                = (known after apply)
      + description                 = (known after apply)
      + destinations                = (known after apply)
      + id                          = (known after apply)
      + identity                    = (known after apply)
      + immutable_id                = (known after apply)
      + kind                        = (known after apply)
      + location                    = (known after apply)
      + name                        = "ama-linux-vm-logs"
      + resource_group_name         = "oms-automation"
      + stream_declaration          = (known after apply)
      + tags                        = (known after apply)
    }

  # module.vm-bootstrap["atlassian-nonprod-jira-03"].data.azurerm_monitor_data_collection_rule.windows_data_collection_rule will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_data_collection_rule" "windows_data_collection_rule" {
      + data_collection_endpoint_id = (known after apply)
      + data_flow                   = (known after apply)
      + data_sources                = (known after apply)
      + description                 = (known after apply)
      + destinations                = (known after apply)
      + id                          = (known after apply)
      + identity                    = (known after apply)
      + immutable_id                = (known after apply)
      + kind                        = (known after apply)
      + location                    = (known after apply)
      + name                        = "ama-windows-vm-logs"
      + resource_group_name         = "oms-automation"
      + stream_declaration          = (known after apply)
      + tags                        = (known after apply)
    }

  # module.vm-bootstrap["atlassian-nonprod-jira-03"].data.azurerm_resource_group.la_rg will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "la_rg" {
      + id         = (known after apply)
      + location   = (known after apply)
      + managed_by = (known after apply)
      + name       = "oms-automation"
      + tags       = (known after apply)
    }

  # module.vm-bootstrap["atlassian-nonprod-jira-03"].azurerm_virtual_machine_extension.dynatrace_oneagent[0] will be updated in-place
  ~ resource "azurerm_virtual_machine_extension" "dynatrace_oneagent" {
        id                          = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-nonprod-jira-03/extensions/Dynatrace"
        name                        = "Dynatrace"
      ~ settings                    = (sensitive value)
        tags                        = {
            "application"  = "atlassian"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (8 unchanged attributes hidden)
    }

Plan: 1 to add, 15 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":93,"Program":"tfcmt","SHA1":"","Target":"nonprod_general - TerraformPlanApply","Vars":{}} -->